---
to: _templates/dist/<%= name %>/story/index.stories.tsx
---
/******************************************************************************
 * import
 *****************************************************************************/
import * as React from 'react';
import { storiesOf } from '@storybook/react';
import * as Component from '../';

/******************************************************************************
 * 定数
 *****************************************************************************/


/******************************************************************************
 * story
 *****************************************************************************/
const stories = storiesOf('New', module);

/**
 * 通常のストーリー
 */
const defaultStory = () => 
{
  // knobs
  // ...

  // actions
  // ...
  
  const props = {}
  return <Component.default {...props} />;
}
stories.add('<%= name %>', defaultStory);